//
//  RecipesData.swift
//  CookingApp
//
//  Created by Georgi Teoharov on 16.06.18.
//  Copyright © 2018 Georgi Teoharov. All rights reserved.
//
enum TypeOfData {
    case dishName
    case recipe
    case timeToCook
    case pictureOfDish
    case favorite
    case seen
}

import Foundation

struct RecipesData {
    static var recipes: [[TypeOfData : String]] =
    [
        [.dishName : "Гергьовска салата",
         .timeToCook : "30 мин.",
         .pictureOfDish : "georgiRecipe",
         .favorite: "",
         .recipe: """
            Продукти:
            
            500 г спанак
            1 шепа коприва
            2 връзки пресен лук
            1 връзка чесън
            1 връзка магданоз
            сол на вкус
            сок от един лимон
            1 с. л. олио
            1 парче сирене
            2-3 сварени яйца
            10 маслини
            млян черен пипер
            
            Приготвяне:
            
            • За рецептата "Гергьовска салата от спанак и коприва" спанакът и копривата се измиват добре и се попарват с вряла вода.
            • Изцеждат се, изстискват се и се нарязват.
            • Слагат се в голяма купа заедно с нарязания лук.
            • Поръсва се със солта, лимоновия сок и олиото и се разбърква леко.
            • Върху салатата се настъргва на едро ренде сиренето.
            • Украсява се с резени яйца и маслини и се поръсва с черен пипер.
            • Гергьовската салата от спанак и коприва се поднася веднага.
            """],
        [.dishName : "Хайдушко гювече",
         .timeToCook : "30 мин.",
         .pictureOfDish : "haidushkoGyuveche",
         .favorite: "",
         .recipe: """
            Продукти:
            
            1 кг крехко свинско от бута
            50 г кашкавал
            7-8 глави кромид лук
            2 глави чесън
            60-70 г краве масло
            300 мл червено вино
            4 зелени чушки
            5 яйца
            1/2 ч. л. кимион
            смлян черен пипер
            сол
            
            Приготвяне:
            
            • Месото се нарязва на дребни късчета.
            • Прехвърлят се в купа.
            • Поръсват се с кимиона, солта и черния пипер.
            • Разбъркват се със ситно нарязаните лук, чесън и чушки.
            • Покриват се със "свежо" фолио.
            • Купата се оставя в хладилник за една нощ.
            • На дъното на всяко гювече се поставя по парче краве масло.
            • Отгоре се разпределя сместа.
            • Виното се сипва по равно във всяко гювече.
            • След което се похлупват с капак или алуминиево фолио.
            • Гювечетата се поставят да се запекат във фурна на 200 С.
            • Малко преди да се извадят, всяко се залива с по едно разбито яйце.
            • Отгоре се поръсва с кашкавал.
            • Хайдушкото гювече се допича без капак до готовност.
            """
        ],
        
        [.dishName : "Месо с картофи, дюли и маслини",
         .timeToCook : "80 мин.",
         .pictureOfDish : "mesoKartofi",
         .favorite: "",
         .recipe: """
            Продукти:
            
            1 кг свинско месо
            4-5 с. л. олио
            2 моркова
            1 глава кромид
            1 ч. л. червен пипер
            2 с. л. доматено пюре
            4-5 картофа
            1-2 дюли
            6-8 маслини
            4-5 с. л. нарязани на ситно домати
            2 с. л. брашно
            1 ч. ч. вино
            сол и млян черен пипер на вкус
            Приготвяне:
            
            1. Нарежете месото на порции и ги запържете за кратко в част от олиото, загрято в тиган на силен огън.
            2. В друг съд сложете нарязаните лук и моркови и ги запържете в останалото олиото. Добавете месото, червения пипер и доматеното пюре. Сипете толкова топла вода, колкото да покрие месото.
            3. Добавете нарязаните картофи и дюли, маслините без костилки и рязаните домати.
            4. Поръсете с брашното, размито в малко студена вода. Сипете виното и малко топла вода, за да се покрие ястието, овкусете със солта и черния пипер и оставете ястието да къкри на бавен огън.
            """
        ],
        
        [.dishName : "Доматен гювеч",
         .timeToCook : "40 мин.",
         .pictureOfDish : "domatenGyuvech",
         .favorite: "",
         .recipe: """
            Продукти:
            
            800 г добре узрели домати
            3 глави кромид
            2 с. л. брашно
            1/2 чаена чаша олио
            20 г масло
            200 г сирене
            магданоз
            3–4 яйца
            1 чаена чаша прясно мляко
            Приготвяне:
            
            • Лукът се нарязва на ситно и се запържва в олиото, заедно с брашното.
            • Доматите се нарязват на филийки и се прибавят към лука.
            • След като се запържат, се изсипват в намазана с масло тавичка и се разпределят на равномерен пласт.
            • Поръсват се с настърганото сирене и нарязания на ситно магданоз.
            • Яйцата се разбиват с прясното мляко и се изсипват върху гювеча.
            • Ястието се пече в силна фурна.
            """
        ],
        
        [.dishName : "Бухтичките на баба",
         .timeToCook : "25 мин.",
         .pictureOfDish : "buhtichki",
         .favorite: "",
         .recipe: """
            Продукти:
            
            2 яйца
            400 мл прясно мляко
            1 ч. л. сол
            2 ч. л. захар
            400 г брашно
            2 пакетчета суха мая
            150 мл олио
            Приготвяне:
            
            1. Яйцата и леко затопленото прясно мляко се разбиват. Прибавят се солта и захарта.
            2. Сипват се брашното и сухата мая и се разбърква, докато се получи рядко тесто.
            3. Оставя се да втаса. От него се гребва със супена лъжица и се пуска в дълбок тиган със сгорещената мазнина.
            4. Изпържените бухтички се отцеждат от мазнината върху салфетка и се сервират топли със сирене или сладко по желание.
            """
        ],
        
        [.dishName : "Кадаиф",
         .timeToCook : "55 мин.",
         .pictureOfDish : "kadaif",
         .favorite: "",
         .recipe: """
            Продукти:
            
            500 г готов кадаиф
            мляна канела
            200 г орехови ядки
            250 г краве масло
            1 л вода
            600 г (3 пълни ч. ч.) захар
            2 с. л. лимонов сок
            1 белтък
            Приготвяне:
            
            • Кадаифът се слага в намазана с масло тава и се наръсва със счуканите орехови ядки и малко канела.
            • Залива се с разтопеното масло и се пече до зачервяване.
            • Оставя се да охлади напълно.
            • Приготвя се сироп, като 20 минути се вари 1 л вода със захарта.
            • Сваля се от огъня, прибавя се лимоновият сок и се охлажда леко.
            • Студеният кадаиф се залива с него.
            • Щом се напои добре, се украсява се с белтъка, разбит на сняг с малко пудра захар.
            """
        ],
        
        [.dishName : "Пълнени дюли",
         .timeToCook : "",
         .pictureOfDish : "pulneniDyuli",
         .favorite: "",
         .recipe: """
            Продукти:
            
            4 големи дюли
            2 с. л. пудра захар
            1 парче тиква
            2 ябълки
            1 к. ч. стафиди
            1 бучка масло
            захар на вкус
            1 пакетче сметана
            сладко по избор
            ром на вкус
            Приготвяне:
            
            1. С остър нож разрежете измитите дюли на половинки така, че да се получи зигзагообразен разрез. Всяка половина изчистете от семките и сърцевината и оформете чашка.
            2. Подредете ги в тава и ги наръсете с пудрата захар. Около плодовете налейте малко вода. Печете ги в умерено силна фурна и ги извадете полуготови.
            3. Тиквата и ябълките нарежете на парченца и ги задушете леко в маслото, захар и малко вода. С омекналите плодове и стафидите напълнете дюлите и ги запечете до пълното им омекване.
            4. След като изстинат, ги гарнирайте с разбита сметана. Украсете ги с плодове от сладкото и при поднасяне ги полейте с малко ром.
            Стефка Анчева от с. Николово
            """
        ],
        
        [.dishName : "Пълнени патладжани",
         .timeToCook : "50 мин.",
         .pictureOfDish : "pulnenPatladjan",
         .favorite: "",
         .recipe: """
            Продукти:
            
            3 патладжана
            250 г кайма
            1/2 глава кромид лук
            1 морков
            2-3 печени червени чушки
            2 домата
            1 скилидка чесън
            смлян черен пипер
            сол
            1/2 връзка магданоз
            олио за пържене
            Приготвяне:
            
            • За рецептата "Пълнени патладжани" фурната се загрява на 200 С.
            • Сините домати се разрязват по дължина и се издълбават.
            • Издълбаното се нарязва на ситно и се оставя настрани.
            • В дълбок тиган се сгорещяват 2-3 с. л. олио.
            • Изпържват се за кратко издълбаните патладжани от двете страни.
            • Изваждат се и се нареждат в огнеупорна тава.
            • За рецептата "Пълнени патладжани" в същият тиган се запържват нарязаните на дребно лук и морков до омекване.
            • Прибавя се каймата и се запържва до побеляване.
            • Добавят се издълбаната част от патладжаните и нарязаните на дребно обелени чушки.
            • Един домат се обелва и настъргва на ренде и се прибавя към сместа в тигана.
            • Всичко за рецептата "Пълнени патладжани"се разбърква и се готви 7-8 минути на умерен огън.
            • Сваля се от котлона и се прибавят сол, черен пипер и ситно нарязаните чесън и магданоз.
            • Сместа се разбърква и с нея се пълнят издълбаните и изпържени лодки от син домат.
            • Вторият домат се нарязва на колелца, които покриват патладжаните отгоре.
            • Патладжаните за рецептата "Пълнени патладжани" се наръсват с малко олио.
            • Сипва се вода в тавата около 1 пръст.
            • Пълнените патладжани се пекат 30-40 минути.
            • Поднасят се с кисело мляко и хляб по желание.
            """
        ],
        
        [.dishName : "Баница с кайма",
         .timeToCook : "45 мин.",
         .pictureOfDish : "banicaKaima",
         .favorite: "",
         .recipe: """
            Продукти:

            500 г кайма смес
            2 глави кромид
            1/2 ч. л. млян черен пипер
            1 ч. л. сушена чубрица
            500 г фини кори за баница
            250 мл газирана вода
            3 яйца
            1/3 ч. ч. олио
            Приготвяне:

            1. Каймата за рецептата "Баница с кайма" се размива с малко вода, докато стане на каша. Кромидът се обелва и се нарязва на много ситно. Прибавя се в кашата от каймата заедно с чубрицата и черния пипер.
            2. В намаслена тава за рецептата "Баница с кайма" се слага 1 кора и върху нея се поставят 2 набрани с ръка кори. Сипва се част от каймата.
            3. Повтаря се до изчерпване на продуктите, като се завършва с 2 цели кори. Баницата се нарязва на парчета и се залива със смес от газираната вода, яйцата и олиото.
            4. Изпича се в силно загрята фурна до готовност и щом се извади, се покрива с кърпа, за да омекне кората.
            """
        ],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
        [.dishName : "",
         .timeToCook : "",
         .pictureOfDish : "",
         .favorite: "",
         .recipe: ""],
        
    ]
}
